[X2ExperienceConfig]
PsiRankNames[8]="Master"
PsiShortNames[8]="Mstr."

[Spark X2SoldierClassTemplate]
RankNames[8]="Templar"
ShortNames[8]="Tpr."

RankIcons[0]="UILibrary_Common.rank_rookie"
RankIcons[1]="UILibrary_Common.rank_squaddie"
RankIcons[2]="UILibrary_Common.rank_lieutenant"
RankIcons[3]="UILibrary_Common.rank_sergeant"
RankIcons[4]="UILibrary_Common.rank_captain"
RankIcons[5]="UILibrary_Common.rank_major"
RankIcons[6]="UILibrary_Common.rank_colonel"
RankIcons[7]="UILibrary_Common.rank_commander"
RankIcons[8]="UILibrary_Common.rank_fieldmarshall"

[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strNeedsSoldierClass="CANNOT EQUIP"
m_strUnavailableToClass="UNAVAILABLE"

[DepthPerceptionPCS X2EquipmentTemplate]
FriendlyName="PCS: Depth Perception"
FriendlyNamePlural="PCS: Depth Perception"
BriefSummary="This cybernetic implant grants 5 aim and reduces enemies' dodge by 25 when you are at a higher elevation than your target."

[HyperReactivePupilsPCS X2EquipmentTemplate]
FriendlyName="PCS: Hyper-Reactive Pupils"
FriendlyNamePlural="PCS: Hyper-Reactive Pupils"
BriefSummary="This implant confers +10 aim for your next shot with your primary weapon after a shot misses."

[CombatAwarenessPCS X2EquipmentTemplate]
FriendlyName="PCS: Combat Awareness"
FriendlyNamePlural="PCS: Combat Awareness"
BriefSummary="Grants 15 defense and a point of armor when on overwatch."

[CombatRushPCS X2EquipmentTemplate]
FriendlyName="PCS: Combat Rush"
FriendlyNamePlural="PCS: Combat Rush"
BriefSummary="When you kill an enemy, allies within 7 tiles temporarily receive bonuses to aim, critical chance and mobility. Five-turn cooldown."

[DamageControlPCS X2EquipmentTemplate]
FriendlyName="PCS: Damage Control"
FriendlyNamePlural="PCS: Damage Control"
BriefSummary="The implant hardens your armor against enemy fire and grants 2 armor for 1 turn after you take damage."

[AbsorptionFieldsPCS X2EquipmentTemplate]
FriendlyName="PCS: Impact Fields"
FriendlyNamePlural="PCS: Impact Fields"
BriefSummary="This shield projector implant may be activated to reduce incoming damage by 33% for two turns."

[BodyShieldPCS X2EquipmentTemplate]
FriendlyName="PCS: Body Shield"
FriendlyNamePlural="PCS: Body Shield"
BriefSummary="The targeted enemy faces -20 aim and -50 critical chance against you."

[EmergencyLifeSupportPCS X2EquipmentTemplate]
FriendlyName="PCS: Emergency Life Support"
FriendlyNamePlural="PCS: Emergency Life Support"
BriefSummary="This implant ensures the first killing blow in a mission will not lead to instant death and extends bleed-out time by two turns."

[IronSkinPCS X2EquipmentTemplate]
FriendlyName="PCS: Iron Skin"
FriendlyNamePlural="PCS: Iron Skin"
BriefSummary="Incoming melee damage is reduced by 3."

[SmartMacrophagesPCS X2EquipmentTemplate]
FriendlyName="PCS: Smart Macrophages"
FriendlyNamePlural="PCS: Smart Macrophages"
BriefSummary="Reduces wound recovery time and grants immunity to acid and poison."

[CenterMass X2AbilityTemplate]
LocFriendlyName="Center Mass"
LocFlyOverText="Center Mass"
LocLongDescription="You do one additional point of base damage when using guns."
LocHelpText="You do one additional point of base damage when using guns."
LocPromotionPopupText="<Bullet/> You do one additional point of base damage with your primary weapon, pistols or a sawed-off shotgun."

[Lethal X2AbilityTemplate]
LocFriendlyName="Lethal"
LocFlyOverText="Lethal"
LocLongDescription="You do two additional points of base damage with your primary weapon."
LocHelpText="You do two additional points of base damage with your primary weapon."
LocPromotionPopupText="<Bullet/> You do two additional points of base damage with your primary weapon."

[HitandSlither X2AbilityTemplate]
LocFriendlyName="Hit and Slither"
LocFlyOverText="Hit and Slither"
LocLongDescription="Once per turn, gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon. "
LocHelpText="Once per turn, gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon."
LocPromotionPopupText="<Bullet/> Once per turn, gain an additional move action after taking a standard shot at a flanked or exposed target with your primary weapon.<br/>

[HitandRun X2AbilityTemplate]
LocFriendlyName="Hit and Run"
LocFlyOverText="Hit and Run"
LocLongDescription="Once per turn, gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon. "
LocHelpText="Once per turn, gain an additional action after taking a standard shot at a flanked or exposed target with your primary weapon."
LocPromotionPopupText="<Bullet/> Cannot be used on the same turn as Run and Gun.<br/><Bullet/> Bonus full actions from Serial and Death from Above will be awarded first."

[CloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within four tiles who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>""

[CloseCombatSpecialistAttack X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within four tiles who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>""

[CloseandPersonal X2AbilityTemplate]
LocFriendlyName="Close and Personal"
LocFlyOverText="Close and Personal"
LocLongDescription="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocHelpText="Confers +30 critical chance against adjacent targets. The bonus declines with distance from the target."
LocPromotionPopupText="<Bullet/> Confers +30 critical chance against adjacent targets.<br/><Bullet/> Bonus reduced by 5% for each additional tile of distance from the target, down to 0% at 7 or more tiles.<br/>"

[DamnGoodGround X2AbilityTemplate]
LocFriendlyName="Damn Good Ground"
LocFlyOverText="Damn Good Ground"
LocLongDescription="Confers +10 aim and +10 defense against targets at a lower elevation."
LocHelpText="Confers +10 aim and +10 defense against targets at a lower elevation."
LocPromotionPopupText="<Bullet/> Confers +10 aim and +10 defense against targets at a lower elevation.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[ExecutionerLW X2AbilityTemplate]
LocFriendlyName="Executioner"
LocFlyOverText="Executioner"
LocLongDescription="Confers +10 aim and +10 critical chance against targets at half or less of their original hit points."
LocHelpText="Confers +10 aim and +10 critical chance against targets at half or less of their original hit points."
LocPromotionPopupText="<Bullet/> Confers +10 aim and +10 critical chance against targets at half or less of their original hit points.<br/>"

[Resilience X2AbilityTemplate]
LocFriendlyName="Resilience"
LocFlyOverText="Resilience"
LocLongDescription="Enemy attacks against you suffer a -50 penalty to critical hit chances."
LocHelpText="Enemy attacks against you suffer a -50 penalty to critical hit chances."
LocPromotionPopupText="<Bullet/> Enemy attacks against you suffer a -50 penalty to critical hit chances.<br/>"

[TacticalSense X2AbilityTemplate]
LocFriendlyName="Tactical Sense"
LocFlyOverText="Tactical Sense"
LocLongDescription="Gain 3 defense for each enemy you can see, up to a maximum of 15 defense."
LocHelpText="Gain 3 defense for each enemy you can see, up to a maximum of 15 defense."
LocPromotionPopupText="<Bullet/> Gain 3 defense for each living enemy you can see, up to a maximum of 15 defense.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Aggression X2AbilityTemplate]
LocFriendlyName="Aggression"
LocFlyOverText="Aggression"
LocLongDescription="Gain +5 critical chance for each enemy you can see, up to a maximum of 30."
LocHelpText="Gain +5 critical chance for each enemy you can see, up to a maximum of 30."
LocPromotionPopupText="<Bullet/> Gain +5 critical chance for each enemy you can see, up to a maximum of 30.<br/><Bullet/> Units visible at squadsight ranges do confer bonus.<br/>"

[BringEmOn X2AbilityTemplate]
LocFriendlyName="Bring 'Em On"
LocFlyOverText="Bring 'Em On"
LocLongDescription="Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8."
LocHelpText="Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8."
LocPromotionPopupText="<Bullet/> Gain +1 damage on critical hits for every two enemies you can see, up to a maximum of +8.<br/><Bullet/> Units visible at squadsight ranges do confer bonus.<br/><Bullet/> Applies to damage from primary weapon only."

[HardTarget X2AbilityTemplate]
LocFriendlyName="Hard Target"
LocFlyOverText="Hard Target"
LocLongDescription="Gain 5 dodge per enemy you can see, up to a maximum of +30."
LocHelpText="Gain 5 dodge per enemy you can see, up to a maximum of +30."
LocPromotionPopupText="<Bullet/> Gain 5 dodge per enemy you can see, up to a maximum of +30.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Infighter X2AbilityTemplate]
LocFriendlyName="Infighter"
LocFlyOverText="Infighter"
LocLongDescription="Gain 25 dodge against attacks within four tiles."
LocHelpText="Gain 25 dodge against attacks within four tiles."
LocPromotionPopupText="<Bullet/> Gain 25 dodge against attacks within four tiles.<br/><Bullet/> Dodge bonus also applies to melee attacks.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[DepthPerception X2AbilityTemplate]
LocFriendlyName="Depth Perception"
LocFlyOverText="Depth Perception"
LocLongDescription="Gain 5 aim and reduce enemies' dodge by 25 when at a higher elevation than your target."
LocHelpText="Gain 5 aim and reduce enemies' dodge by 25 when at a higher elevation than your target."
LocPromotionPopupText="<Bullet/> Gain 5 aim and reduce enemies' dodge by 25 when at a higher elevation than your target.<br/>"

[WilltoSurvive X2AbilityTemplate]
LocFriendlyName="Will to Survive"
LocFlyOverText="Will to Survive"
LocLongDescription="Enemy damage is reduced by 1 when in cover and attacked through that cover. Also grants 5 will."
LocHelpText="Enemy damage is reduced by 1 when in cover and attacked through that cover."
LocPromotionPopupText="<Bullet/> Enemy damage is reduced by 1 when in cover and attacked through that cover.<br/><Bullet/> Cover against explosives and other indirect attacks is calculated from the point of the explosion.<br/><Bullet/> Armor piercing effects do not eliminate this bonus.<br/><Bullet/> This unit also permanently gains 5 will.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LightEmUp X2AbilityTemplate]
LocFriendlyName="Light 'Em Up"
LocFlyOverText="Light 'Em Up"
LocLongDescription="Taking a standard shot with your primary weapon as your first action no longer ends your turn."
LocHelpText="Taking a standard shot with your primary weapon as your first action no longer ends your turn."
LocPromotionPopupText="<Bullet/> Taking a standard shot with your primary weapon as your first action no longer ends your turn.<br/>"

[CloseEncounters X2AbilityTemplate]
LocFriendlyName="Close Encounters"
LocFlyOverText="Close Encounters"
LocLongDescription="Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within four tiles."
LocHelpText="Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within four tiles."
LocPromotionPopupText="<Bullet/> Once per turn, gain a bonus action after taking a standard shot with your primary weapon at an enemy within four tiles.<br/><Bullet/> A red ring will mark the range of this ability.<br/><Bullet/> Close Encounters cannot be used on the same turn as Run and Gun.<br/>"

[LoneWolf X2AbilityTemplate]
LocFriendlyName="Lone Wolf"
LocFlyOverText="Lone Wolf"
LocLongDescription="Gain +10 aim and +10 defense when 7 or more tiles distant from any ally."
LocHelpText="Gain +10 aim and +10 defense when 7 or more tiles distant from any ally."
LocPromotionPopupText="<Bullet/> Gain +10 aim and +10 defense when 7 or more tiles distant from any ally.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[LowProfile X2AbilityTemplate]
LocFriendlyName="Low Profile"
LocFlyOverText="Low Profile"
LocLongDescription="Makes partial cover count as full."
LocHelpText="Makes partial cover count as full."
LocPromotionPopupText="<Bullet/> Makes partial cover count as full.<br/>"

[DoubleTap X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocFlyOverText="Double Tap"
LocLongDescription="Special shot: Fire two shots with your primary weapon at the same target. Requires both actions. Second shot is at a -10 aim penalty."
LocHelpText="Fire two shots at the same target with a to-hit penality on the second shot."
LocPromotionPopupText="<Bullet/> Double Tap allows you to take two shots at the same target, with the second shot at a -10 penalty to hit. It requires two actions and ends the turn.<br/><Bullet/> Consumes <Ability:SelfAmmoCost/> ammo and has a one-turn cooldown.<br/>"

[TraverseFire X2AbilityTemplate]
LocFriendlyName="Traverse Fire"
LocFlyOverText="Traverse Fire"
LocLongDescription="After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action."
LocHelpText="After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action."
LocPromotionPopupText="<Bullet/> After taking a standard shot with your primary weapon with your first action, you may take an additional non-movement action.<br/>"

[WalkFire X2AbilityTemplate]
LocFriendlyName="Walk Fire"
LocFlyOverText="Walk Fire"
LocLongDescription="Take a highly accurate shot with +30 bonus to hit but for half damage and -30 crit. Uses <Ability:SelfAmmoCost/> ammo."
LocHelpText="Special shot: +30 aim, -30 crit, half damage, uses <Ability:SelfAmmoCost/> ammo."
LocPromotionPopupText="<Bullet/> This is a special shot in which the soldier adjusts their aim in the middle of an automatic weapon burst, conferring +30 aim and -30 crit and doing half damage.<br/><Bullet/> Consumes <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Usable once per turn.<br/><Bullet/> Requires a burst-fire weapon; ability will not be available when a shotgun or sniper rifle is equipped as a primary weapon."

[PrecisionShot X2AbilityTemplate]
LocFriendlyName="Precision Shot"
LocFlyOverText="Precision Shot"
LocLongDescription="Take a special shot with +30 bonus to critical chance and 33% bonus critical damage. Three-turn cooldown."
LocHelpText="Take a special shot with +30 bonus to critical chance and 33% bonus critical damage. Three-turn cooldown."
LocPromotionPopupText="<Bullet/> Take a special shot with +30 bonus to critical chance and 33% bonus critical damage. Three-turn cooldown.<br/>"

[CyclicFire X2AbilityTemplate]
LocFriendlyName="Cyclic Fire"
LocFlyOverText="Cyclic Fire"
LocLongDescription="Special Shot: Fire three shots at a target in a single attack. Requires both actions and all shots have aim penalties. Four-turn cooldown."
LocHelpText="Special Shot: Fire three shots at a target in a single attack. Requires both actions and all shots have aim penalties. Four-turn cooldown."
LocPromotionPopupText="<Bullet/> Special Shot: Fire three shots at a target in a single attack. Requires two actions and all shots have a -15 penalty to aim.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Requires a burst-fire weapon; ability will not be available when a shotgun or sniper rifle is equipped as a primary weapon."

[StreetSweeper X2AbilityTemplate]
LocFriendlyName="Trench Gun"
LocFlyOverText="Trench Gun"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets. Three-turn cooldown."
LocHelpText="Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets. Three-turn cooldown."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a short-range cone-based attack at nearby targets.<br/><Bullet/> Three-turn cooldown, uses <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Ability will not be available with other primary weapons.<br/><Bullet/> The shot will not penetrate heavy cover, so this ability is best used in flanking situations.<br/><Bullet/> Allies in the area of effect can take damage.<br/>

[SlugShot X2AbilityTemplate]
LocFriendlyName="Slug Shot"
LocFlyOverText="Slug Shot"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a shot that pierces two armor and has no range penalties. Uses <Ability:SelfAmmoCost/> ammo. Three-turn cooldown."
LocHelpText="Armor-piercing special shotgun shot with no range penalties."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a shot with no range penalties.<br/><Bullet/> The shot will pierce two armor points.<br/><Bullet/> Three-turn cooldown.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/>"

[SlugShotRangeEffect X2AbilityTemplate]
LocFriendlyName="Slug Shot"
LocFlyOverText="Slug Shot"
LocLongDescription="Special shot for primary-weapon shotguns only: Fire a shot with no range penalties. Uses <Ability:SelfAmmoCost/> ammo. Five-turn cooldown."
LocHelpText="Special shot for primary-weapon shotguns only: Fire a shot with no range penalties. Uses <Ability:SelfAmmoCost/> ammo. Five-turn cooldown."
LocPromotionPopupText="<Bullet/> Special shot for primary-weapon shotguns only: Fire a shot with no range penalties.<br/><Bullet/> Five-turn cooldown.<br/><Bullet/> Requires <Ability:SelfAmmoCost/> ammo.<br/>"

[Commissar X2AbilityTemplate]
LocFriendlyName="Commissar"
LocFlyOverText="Commissar"
LocLongDescription="Pistol shots against allies who have been mind-controlled by enemies have +50 to hit, cannot be dodged, and automatically kill the target if a hit occurs."
LocHelpText="Pistol shots against allies who have been mind-controlled by enemies have +50 to hit, cannot be dodged, and automatically kill the target if a hit occurs."
LocPromotionPopupText="<Bullet/> Pistol shots against allies who have been mind-controlled by enemies have +50 to hit, cannot be dodged, and automatically kill the target if a hit occurs.<br/>"

[ClutchShot X2AbilityTemplate]
LocFriendlyName="Clutch Shot"
LocFlyOverText="Clutch Shot"
LocLongDescription="Once per mission, fire a pistol shot that cannot miss."
LocHelpText="Once per mission, fire a pistol shot that cannot miss."
LocPromotionPopupText="<Bullet/> Once per mission, fire a pistol shot that cannot miss.<br/>"

[Gunslinger X2AbilityTemplate]
LocFriendlyName="Gunslinger"
LocFlyOverText="Gunslinger"
LocLongDescription="Take a reaction shot with your pistol against any enemy that moves or attacks within 12 tiles and a wide cone of fire."
LocHelpText="Enhanced pistol overwatch in a cone of fire."
LocPromotionPopupText="<Bullet/> Range is 12 tiles.<br/><Bullet/> Three-turn cooldown.<br/>"

[HyperReactivePupils X2AbilityTemplate]
LocFriendlyName="Hyper-Reactive Pupils"
LocFlyOverText="Hyper-Reactive Pupils"
LocLongDescription="Gain +10 aim for your next shot with your primary weapon after a miss."
LocHelpText="Gain +10 aim for your next shot with your primary weapon after a miss."
LocPromotionPopupText="<Bullet/> Bonus applies until the next time you hit a target or the mission ends.<br/><Bullet/> Area-of-Effect-based shots do not induce the bonus.<br/>"

[SteadyWeapon X2AbilityTemplate]
LocFriendlyName="Steady Weapon"
LocFlyOverText="Steady Weapon"
LocLongDescription="Gain +20 aim on your next shot with your primary weapon. Multiple uses will stack bonus. Bonus is lost if you use actions or are wounded."
LocHelpText="Gain +20 aim on your next shot with your primary weapon. Multiple uses will stack bonus. Bonus is lost if you use actions or are wounded."
LocPromotionPopupText="<Bullet/> Gain +20 aim on your next shot with your primary weapon. Bonus is lost if you use actions or are wounded.<br/><Bullet/> Cannot Steady Weapon when suppressed.<br/><Bullet/> Effect will persist through multiple turns if you do nothing.<br/><Bullet/> Using Steady Weapon over multiple consecutive turns will allow the bonus to stack."

[LockedOn X2AbilityTemplate]
LocFriendlyName="Locked On"
LocFlyOverText="Locked On"
LocLongDescription="Gain +10 aim and +10 crit for successive shots at the same enemy unit."
LocHelpText="Gain +10 aim for successive shots at the same enemy unit."
LocPromotionPopupText="<Bullet/> Gain +10 aim and +10 crit for repeated shots with your primary weapon at the same target. Not cumulative, and only applies to enemy units.<br/><Bullet/> Area-of-Effect-based shots do not grant the bonus."

[Sentinel_LW X2AbilityTemplate]
LocFriendlyName="Sentinel"
LocFlyOverText="Sentinel"
LocLongDescription="When in overwatch, you may take two reaction shots."
LocHelpText="When in overwatch, you may take two reaction shots."
LocPromotionPopupText="<Bullet/> Reaction shots may be at one or multiple targets, depending on alien movement.<br/>"

[RapidReaction X2AbilityTemplate]
LocFriendlyName="Rapid Reaction"
LocFlyOverText="Rapid Reaction"
LocLongDescription="When in overwatch, each shot you hit with grants another reaction fire shot, up to a maximum of three shots."
LocHelpText="When in overwatch, each shot you hit with grants another shot, up to a maximum of three shots."
LocPromotionPopupText="<Bullet/> When in overwatch, each shot you hit with grants another reaction fire shot, up to a maximum of three shots.<br/>"

[LightningReflexes_LW X2AbilityTemplate]
LocFriendlyName="Lightning Reflexes"
LocFlyOverText="Lightning Reflexes"
LocLongDescription="Reaction fire shots against you have a significantly decreased chance to hit. The bonus goes down with each additional reaction shot you face."
LocHelpText="Reaction fire shots against you have a decreased chance to hit."
LocPromotionPopupText="<Bullet/> Reaction fire shots against you have a significantly decreased chance to hit.<br/><Bullet/> The first reaction shot against you during a turn is at -100 to hit; the second at -80; the third at -60; the fourth at -40, and the fifth at -20. Further reaction shots at are normal to hit chances.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[Cutthroat X2AbilityTemplate]
LocFriendlyName="Cutthroat"
LocFlyOverText="Cutthroat"
LocLongDescription="Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."
LocHelpText="Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."
LocPromotionPopupText="<Bullet/> Your melee attacks against biological enemies ignore their armor, have a +15 critical chance, and do +2 critical damage."

[KillerInstinct X2AbilityTemplate]
LocFriendlyName="Killer Instinct"
LocFlyOverText="Killer Instinct"
LocLongDescription="Activating Run & Gun grants +50% critical damage for the rest of the turn."
LocHelpText="Activating Run & Gun grants +50% critical damage for the rest of the turn."
LocPromotionPopupText="<Bullet/> Activating Run & Gun grants +50% critical damage for the rest of the turn.<br/>"

[ExtraConditioning X2AbilityTemplate]
LocFriendlyName="Extra Conditioning"
LocFlyOverText="Extra Conditioning"
LocLongDescription="Run and Gun cooldown is reduced by one turn."
LocHelpText="Run and Gun cooldown is reduced by one turn."
LocPromotionPopupText="<Bullet/> Run and Gun cooldown is reduced by one turn.<br/>"

[RunAndGun_LW X2AbilityTemplate]
LocFriendlyName="Run And Gun"
LocFlyOverText="Run And Gun"
LocLongDescription="Take an action after dashing."
LocHelpText="Take an action after dashing."
LocPromotionPopupText="<Bullet/> Run and Gun allows soldiers to close the distance to their targets rapidly, or to easily take a flanking position.<br/><Bullet/> Run and Gun has a 3 turn cooldown.<br/>"

[Suppression_LW X2AbilityTemplate]
LocFriendlyName="Suppression"
LocFlyOverText="Suppression"
LocLongDescription="Fire a barrage that pins down a target, grants reaction fire against it if it moves, restricts the use of many abilities, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move."
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/><Bullet/> May not be used if sniper rifle or shotgun-class weapons are equipped.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades."

[AreaSuppression X2AbilityTemplate]
LocFriendlyName="Area Suppression"
LocFlyOverText="Area Suppression"
LocLongDescription="Fire a barrage that pins down multiple targets within a 4-tile radius, granting reaction fire against anyone that moves, and imposing a <Ability:SUPPRESSIONPENALTY/> penalty to all targets' aim until suppression is removed. Cannot be used when concealed."
LocHelpText="Suppress multiple targets within an area of effect."
LocPromotionPopupText="<Bullet/> Area Suppression cannot be used when the soldier is concealed.<br/><Bullet/> Any unit that attempts to move will face reaction fire as long as the suppressing unit has ammo remaining.<br/><Bullet/> Does not work with shotguns or sniper rifles.<br/><Bullet/> Area Suppression costs <Ability:SelfAmmoCost/> ammo points to use, plus one additional ammo for each reaction shot. It has no cooldown.<br/><Bullet/> Area suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/><Bullet/> Suppression restricts many of the target's abilities, including the use of rockets and grenades.""

[SuppressionShot_LW X2AbilityTemplate]
LocFriendlyName="Suppression"
LocFlyOverText="Suppression"

[DangerZone X2AbilityTemplate]
LocFriendlyName="Danger Zone"
LocFlyOverText="Danger Zone"
LocLongDescription="Area Suppression suppresses enemies in a 5-tile radius."
LocHelpText="Wider Area Suppression."
LocPromotionPopupText="<Bullet/> Area Suppression suppresses enemies in a 5-tile radius.<br/>

[Lockdown X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +15 to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +15 to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[Lockdown X2AbilityTemplate]
LocFriendlyName="Lockdown"
LocFlyOverText="Lockdown"
LocLongDescription="Gain +15 to hit against enemies who attempt to move when suppressed."
LocHelpText="Bonus hit chance and damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain +15 to hit against enemies who attempt to move when suppressed.<br/><Bullet/> This stacks with other reaction fire bonuses."

[Mayhem X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocFlyOverText="Mayhem"
LocLongDescription="Gain 25% bonus damage against enemies who attempt to move when suppressed."
LocHelpText="Bonus damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain 25% bonus damage against enemies who attempt to move when suppressed.<br/>"

[MayhemBonuses X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocFlyOverText="Mayhem"
LocLongDescription="Gain 20% bonus damage against enemies who attempt to move when suppressed."
LocHelpText="Bonus damage to enemies who attempt to move when suppressed."
LocPromotionPopupText="<Bullet/> Gain 20% bonus damage against enemies who attempt to move when suppressed.<br/>"

[Interference X2AbilityTemplate]
LocFriendlyName="Interference"
LocFlyOverText="Interference"
LocLongDescription="GREMLIN cancels overwatch on targeted unit. Use three times per battle."
LocHelpText="Cancels overwatch on targeted unit."
LocPromotionPopupText="<Bullet/> Cancels overwatch on targeted unit.<br/><Bullet/> Uses one action.<br/><Bullet/> 3 charges per battle, improves with better Gremlin tech.<br/>"

[DamageControl X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocFlyOverText="Damage Control"
LocLongDescription="After taking damage, gain 2 armor through the end of the turn."
LocHelpText="After taking damage, gain 2 armor through the end of the turn."
LocPromotionPopupText="<Bullet/> Your armor hardens temporarily after an impact. After taking damage, gain 2 armor through the end of the next turn.

[DamageControlPassive X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocFlyOverText="Damage Control"
LocLongDescription="After taking damage, gain 2 armor through the end of the turn."
LocHelpText="After taking damage, gain 2 armor through the end of the turn."
LocPromotionPopupText="<Bullet/> Your armor hardens temporarily after an impact. After taking damage, gain 2 armor through the end of the next turn.

[Evasive X2AbilityTemplate]
LocFriendlyName="Evasive"
LocFlyOverText="Evasive: +100 Dodge"
LocLongDescription="Start each mission with 100 bonus dodge. The bonus is removed after you take damage for the first time."
LocHelpText="Gain 100 dodge until you take damage."
LocPromotionPopupText="<Bullet/> This ability will typically turn the first hit on a soldier into a graze, but being hit with undodgeable attacks will remove it without any bonus being applied."

[RemoveEvasive X2AbilityTemplate]
LocFriendlyName="Evasive bonus lost"
LocFlyOverText="Evasive bonus lost"
LocLongDescription="Start each mission with 100 bonus dodge. The bonus is removed after you take damage for the first time."
LocHelpText="Gain 100 dodge until you take damage."
LocPromotionPopupText="<Bullet/> This ability will typically turn the first hit on a soldier into a graze, but being hit with undodgeable attacks will remove it without any bonus being applied."

[SnapShot X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocHelpText="Shoot the target."
LocLongDescription="You may take standard shots with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range."
LocPromotionPopupText="<Bullet/> The soldier may now use the sniper rifle for standard shots after moving, but suffers extreme aim penalties at targets beyond 22 tiles range on those shots.<br/><Bullet/> The soldier may not enter overwatch with the sniper rifle after moving.<br/>

;LocLongDescription="You may take standard shots and enter standard overwatch with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range on all shots."
;LocPromotionPopupText="<Bullet/> This ability significantly alters the way the Sharpshooter operates: The soldier may now use the sniper rifle for standard shots and overwatch after moving, but suffers extreme aim penalties at targets beyond 22 tiles range on all shots, regardless of whether the soldier has moved or not.<br/><Bullet/> Only works with Sniper Rifles.<br/><Bullet/> Reduces close range penalties by 1/3 relative to normal sniper rifles.<br/><Bullet/> After 5 tiles of squadsight, suffer an additional -20 aim per tile.<br/><Bullet/> Certain special shots and Long Watch still require both actions to use. Long Watch enables squadsight overwatch fire, but the range penalties still apply.<br/><Bullet/> The solder will not take an overwatch or Kill Zone shot without at least a 1% chance to hit."

[SnapShotOverwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire on the first enemy that moves within your line of sight, with a penalty to to aim. The solder will not take an overwatch shot without at least a 1% chance to hit."
LocLongDescriptionWhenConcealed="Fire on the first enemy that moves within your line of sight, but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[SnapShotAimModifier X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocFlyOverText="Snap Shot"
LocLongDescription="You may take standard shots and enter standard overwatch with your sniper rifle after moving, but you suffer severe range penalties beyond 5 tiles of squadsight range on all shots."
LocHelpText="Allows standard shots and overwatch with sniper rifles after moving."

[Trojan X2AbilityTemplate]
LocFriendlyName="Trojan"
LocFlyOverText="Trojan"
LocLongDescription="Enemy units that are hacked take damage and lose their actions on the turn the hack effect ends."
LocHelpText="Hacked units suffer damage and action loss when hack effect ends."
LocPromotionPopupText="<Bullet/> Enemy units hacked by Haywire Protocol take 0 to 8 damage and lose their actions on the turn the hack effect ends.<br/><Bullet/> Applies to units stunned or taken over by Haywire Protocol.<br/><Bullet/> Damage calculated based on Hacking Stat vs. target's Hack Defense.<br/>"

[Covert X2AbilityTemplate]
LocFriendlyName="Covert"
LocFlyOverText="Covert"
LocLongDescription="Enemies have 25% smaller detection range against you."
LocHelpText="Enemies have reduced detection range against you."
LocPromotionPopupText="<Bullet/> Enemies have 25% smaller detection range against you, as denoted by red tiles surrounding enemies who are not alerted to your presence.<br/><Bullet/> This ability also grants a small reduction in this soldier's impact on infiltration times.<br/><Bullet/> Does not apply to ADVENT security towers."

[Ghostwalker X2AbilityTemplate]
LocFriendlyName="Ghostwalker"
LocFlyOverText="Ghostwalker"
LocLongDescription="Activate this ability to reduce enemy detection range against you by almost 25% for the rest of your turn as well as the following turn."
LocHelpText="Reduce enemy detection range by 25% for two turns."
LocPromotionPopupText="<Bullet/> Activate this ability to reduce enemy detection range against you by almost 25% for two turns (including the current turn), as denoted by red tiles surrounding enemies who are not alerted to your presence.<br/><Bullet/> <Ability:SelfCooldown/>-turn cooldown.<br/><Bullet/> Requires no actions to activate.<br/><Bullet/> This ability also grants a small reduction in this soldier's impact on infiltration times.<br/><Bullet/> Does not apply to ADVENT security towers."

[Kubikuri X2AbilityTemplate]
LocFriendlyName="Kubikiri"
LocFlyOverText="Kubikiri"
LocLongDescription="Special shot against most enemies who have taken any damage: Any critical hit kills them, but regular hits do half damage. Requires two actions and has a 4-turn cooldown."
LocHelpText="Crits automatically kill enemies at less than full hit points. Regular hits do half damage."
LocPromotionPopupText="<Bullet/> Special shot against enemies with less than full hit points: Any critical hit kills them, but regular hits do half damage.<br/><Bullet/> Requires two actions.<br/><Bullet/> 4-turn cooldown.<br/><Bullet/> Against alien rulers, a critical hit will do double normal crit damage instead of killing the enemy outright."

[CombatAwareness X2AbilityTemplate]
LocFriendlyName="Combat Awareness"
LocFlyOverText="Combat Awareness"
LocLongDescription="Grants 15 defense and an armor point when in overwatch."
LocHelpText="Grants 15 defense and an armor point when in overwatch."
LocPromotionPopupText="<Bullet/> Gain 15 defense and an armor point when in overwatch.<br/><Bullet/> This ability does not provide defensive bonuses if the unit is disoriented, stunned, panicking, on fire or otherwise impaired."

[FieldSurgeon X2AbilityTemplate]
LocFriendlyName="Field Surgeon"
LocFlyOverText="Field Surgeon"
LocLongDescription="Reduce wound recovery times for most soldiers."
LocHelpText="Reduce wound recovery times for most soldiers."
LocPromotionPopupText="<Bullet/> Field Surgeon reduces the number of hit points a soldier must heal after being wounded in battle by 1.<br/><Bullet/> Multiple Field Surgeons on a mission have a chance to reduce wound recovery time further.<br/><Bullet/> The effect includes the soldier with the ability.<br/><Bullet/> It does not affect soldiers who suffered killing wounds and are stabilized from bleeding out."

[Flashbanger X2AbilityTemplate]
LocFriendlyName="Flashbanger"
LocFlyOverText="Flashbanger"
LocLongDescription="Grants 1 free flashbang item to your inventory."
LocHelpText="Grants 1 free flashbang item to your inventory."
LocPromotionPopupText="<Bullet/> Grants 1 free flashbang item to your inventory.<br/>"

[SmokeGrenade X2AbilityTemplate]
LocFriendlyName="Smoker"
LocFlyOverText="Smoker"
LocLongDescription="Grants one free smoke grenade item to your inventory."
LocHelpText="Grants one free smoke grenade item to your inventory."
LocPromotionPopupText="<Bullet/> Grants one free smoke grenade item to your inventory.<br/>"

[Savior X2AbilityTemplate]
LocFriendlyName="Savior"
LocFlyOverText="Savior"
LocLongDescription="Healing abilities restore four additional hit points."
LocHelpText="Healing abilities restore 4 additional hit points."
LocPromotionPopupText="<Bullet/> Effect applies to GREMLIN heal, Medikits and Restoration abilities.<br/>"

[DenseSmoke X2AbilityTemplate]
LocFriendlyName="Dense Smoke"
LocFlyOverText="Dense Smoke"
LocLongDescription="Your smoke grenades confer an additional 10 defense."
LocHelpText="Your smoke grenades confer an additional 10 defense."
LocPromotionPopupText="<Bullet/> Your smoke grenades confer an additional 10 defense to those within the smoke, for a total of 30.<br/>"

[DenseSmokeGrenade X2GrenadeTemplate]
FriendlyName="Dense Smoke Grenade"
FriendlyNamePlural="Dense Smoke Grenades"
BriefSummary="Provides a increased defensive boost to any unit within the radius of the smoke, friend or foe."
TacticalText="<Bullet/> Smoke can be deployed to instantly increase the defense of nearby units.<br/><Bullet/> Smoke grenades can be thrown and launched significantly further than standard grenades."
ThrownAbilityName="Throw Dense Smoke Grenade"
ThrownAbilityHelpText="Grants a defensive boost to units within its radius."
LaunchedAbilityname="Launch Dense Smoke Grenade"
LaunchedAbilityHelpText="Grants a defensive boost to units within its radius."

[DenseSmokeGrenadeMk2 X2GrenadeTemplate]
FriendlyName="Dense Smoke Bomb"
FriendlyNamePlural="Dense Smoke Bombs"
BriefSummary="The upgraded Dense Smoke Bomb provides a significant defensive boost to any unit within the radius of the smoke, friend or foe."
TacticalText="<Bullet/> Dense Smoke Bombs, a powerful upgrade to our earlier Smoke Grenades, grant greater defense in a larger radius.<br/><Bullet/> Smoke can be deployed to instantly increase the defense of nearby units.<br/><Bullet/> Smoke Bombs can be thrown and launched significantly further than standard grenades."
ThrownAbilityName="Throw Dense Smoke Bomb"
ThrownAbilityHelpText="Grants a significant defensive boost to units within its radius."
LaunchedAbilityname="Launch Dense Smoke Bomb"
LaunchedAbilityHelpText="Grants a significant defensive boost to units within its radius."

[StingGrenades X2AbilityTemplate]
LocFriendlyName="Sting Grenades"
LocFlyOverText="Sting Grenades"
LocLongDescription="Your flashbang grenades have a 50% chance to stun enemies for one turn in the flashbang's Area of Effect."
LocHelpText="Your flashbang grenades have a 50% chance to stun enemies."
LocPromotionPopupText="<Bullet/> Your flashbang grenades have a 50% chance to stun enemies.<br/>"

[X2Item_StingGrenade]
DenseSmokeGrenadeEffectDisplayName="Sting Grenade"
DenseSmokeGrenadeEffectDisplayDesc="Sting Grenades have a 50% chance to stun units within the grenades' area of effect."

[StingGrenade X2GrenadeTemplate]
FriendlyName="Sting Grenade"
FriendlyNamePlural="Sting Grenades"
BriefSummary="Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them."
TacticalText="<Bullet/> Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them.<br/>"
ThrownAbilityName="Throw Sting Grenade"
ThrownAbilityHelpText="Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them."
LaunchedAbilityname="Launch Sting Grenade"
LaunchedAbilityHelpText="Provides a 50% chance to stun units in area of effect for one turn, as well as disorienting them."

[RapidDeployment X2AbilityTemplate]
LocFriendlyName="Rapid Deployment"
LocFlyOverText="Rapid Deployment"
LocLongDescription="Activate this ability before throwing or launching a support grenade, and the throw will not cost an action."
LocHelpText="Activate this ability before throwing or launching a support grenade, and the throw will not cost an action."
LocPromotionPopupText="<Bullet/> Activate this ability before throwing or launching a support grenade, and the throw will not cost an action.<br/><Bullet/> Applies to Smoke Grenades, Flashbangs and Battle Scanners.<br/><Bullet/> Two-turn cooldown.<br/>"

[CombatRush X2AbilityTemplate]
LocFriendlyName="Combat Rush"
LocFlyOverText="Combat Rush"
LocLongDescription="When you kill an enemy, nearby allies temporarily receive bonuses to aim, critical chance and mobility. Five-turn cooldown."
LocHelpText="When you kill an enemy, nearby allies receive temporary bonus to aim, crit chance and mobility."
LocPromotionPopupText="<Bullet/> Combat Rush triggers when you kill an enemy unit and provides allies within seven tiles +10 aim, +10 critical chance and +1 mobility.<br/><Bullet/> The effect lasts until the end of the following turn after the kill.<br/><Bullet/> It can only trigger every five turns.<br/>"

[BroadcastCombatRush X2AbilityTemplate]
LocFriendlyName="Combat Rush"
LocFlyOverText="Combat Rush"
LocLongDescription="Nearby ally grants you +10 aim, +10 critical chance and +1 mobility for two turns."
LocHelpText="Nearby ally grants you +10 aim, +10 critical chance and +1 mobility for two turns."

[GrazingFire X2AbilityTemplate]
LocFriendlyName="Grazing Fire"
LocFlyOverText="Grazing Fire"
LocLongDescription="Missed shots with your primary weapon have an additional roll to become a graze."
LocHelpText="Misses may become grazes."
LocPromotionPopupText="<Bullet/> Missed shots with the soldier's primary weapon generally have a <Ability:GRAZING_FIRE_SUCCESS_CHANCE>% chance to become a graze.<br/><Bullet/> This effect occurs after normal hit-miss-graze processing.<br/><Bullet/> Targets with a dodge score subtract that score from the ability's success chance."

[HeavyFrags X2AbilityTemplate]
LocFriendlyName="Boosted Cores"
LocFlyOverText="Boosted Cores"
LocLongDescription="Explosive grenades do one additional damage."
LocHelpText="Explosive grenades do one additional damage."
LocPromotionPopupText="<Bullet/> Your grenades have extra explosives and do one additional damage but require special training to handle.<br/><Bullet/> This also applies to grenade effects, like fire from incendiary weapons.<br/>"

[Airdrop X2AbilityTemplate]
LocFriendlyName="Airdrop"
LocFlyOverText="Airdrop"
LocLongDescription="The Gremlin grants an explosive grenade to the targeted ally. Use twice per mission."
LocHelpText="Grants an explosive grenade to the targeted ally."
LocPromotionPopupText="<Bullet/> Grants an explosive grenade to the targeted ally.<br/><Bullet/> Airdrop initially confers a frag grenade, but as XCOM's technology improves it will instead provide a more advanced device.<br/><Bullet/> Activating Airdrop uses one action and does not end the soldier's turn.<br/><Bullet/> Use twice per mission."

[SwordSlice_LW X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/> Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position.<br/>"

[Fleche X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/>  Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position.<br/>"

[FullKit X2AbilityTemplate]
LocFriendlyName="Full Kit"
LocFlyOverText="Full Kit"
LocLongDescription="Grants +1 charge per grenade item in a utility slot."
LocHelpText="Grants +1 charge per grenade item in a utility slot."
LocPromotionPopupText="<Bullet/> Grants +1 charge per grenade item in a utility slot.<br/><Bullet/> Applies to explosive and support grenades as well as Battle Scanners.<br/>"

[Bastion X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[BastionPassive X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[BastionCleanse X2AbilityTemplate]
LocFriendlyName="Bastion"
LocLongDescription="Fortress now provides immunity to nearby teammates."
LocHelpText="Fortress now provides immunity to nearby teammates."
LocFlyOverText="Bastion"
LocPromotionPopupText="<Bullet/> Bastion has a 4 tile radius.<br/><Bullet/> Moving next to afflicted allies will immediately cleanse their negative physical status effects.<br/>"

[IronCurtain X2AbilityTemplate]
LocFriendlyName="Iron Curtain"
LocFlyOverText="Iron Curtain"
LocLongDescription="Special shot that does half damage but reduces target mobility for the following two turns. Cone-based attack with primary weapon."
LocHelpText="Special shot that does low damage but reduces enemy mobility for the following two turns."
LocPromotionPopupText="<Bullet/> If this cone-based attack hits, Iron Curtain does half normal damage and imposes -5 mobility to the enemy for two turns.<br/><Bullet/> Three-turn cooldown.<br/><Bullet/> Uses three ammo.<br/><Bullet/> Can be used after moving.<br/><Bullet/> Iron Curtain does not work with shotguns or sniper rifles.<br/><Bullet/> Allies in the cone can be hit by this ability.<br/>"

[IronCurtainShot X2AbilityTemplate]
LocFriendlyName="Iron Curtain"
LocFlyOverText="Iron Curtain"
LocLongDescription="Special shot that does low damage but reduces enemy mobility for the following two turns. Cone-based attack with primary weapon."
LocHelpText="Special shot that does low damage but reduces enemy mobility for the following two turns."
LocPromotionPopupText="<Bullet/> If it hits, Iron Curtain does 25% normal damage and imposes -4 mobility to the enemy for two turns.<br/><Bullet/> Four-turn cooldown.<br/><Bullet/> Uses <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Can be used after moving.<br/><Bullet/> Iron Curtain does not work with shotguns or sniper rifles.<br/>"
str_IronCurtainEffect="Iron Curtain"

[Slash_LW X2AbilityTemplate]
LocFriendlyName="Slash"
LocFlyOverText="Slash"
LocLongDescription="Attack an adjacent target with your sword. Uses one action."
LocHelpText="Attack an adjacent target with your sword. Uses one action."
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your sword.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[AbsorptionFields X2AbilityTemplate]
LocFriendlyName="Impact Fields"
LocFlyOverText="Impact Fields"
LocLongDescription="Activate a force field that reduces incoming damage by 33% for two turns. Six-turn cooldown."
LocHelpText="Activate a force field that reduces incoming damage by 33% for two turns. Six-turn cooldown."
LocPromotionPopupText="<Bullet/> Activate a force field that reduces incoming damage by 33% for two turns.<br/><Bullet/> Six-turn cooldown (including the turn in which it was activated).<br/><Bullet/> Uses one action and doesn't automatically end your turn.<br/><Bullet/> Armor-Piercing weapons do not mitigate this effect.<br/>"

[BodyShield X2AbilityTemplate]
LocFriendlyName="Body Shield"
LocFlyOverText="Body Shield"
LocLongDescription="A targeted enemy receives -20 aim and -50 critical chance against the soldier."
LocHelpText="The targeted enemy receives -20 aim and -50 critical chance against the soldier."
LocPromotionPopupText="<Bullet/> A targeted enemy receives -20 aim and -50 critical chance against the soldier.<br/>"

[EmergencyLifeSupport X2AbilityTemplate]
LocFriendlyName="Emergency Life Support"
LocFlyOverText="Emergency Life Support"
LocLongDescription="Emergency Life Support ensures the first killing blow in a mission will not lead to instant death. It also extends the time before the soldier bleeds out and dies."
LocHelpText="Ensures the first killing blow in a mission will not lead to instant death and extends bleed-out time."
LocPromotionPopupText="<Bullet/> Emergency Life Support make the first check for bleeding out each mission an automatic success.<br/><Bullet/> Adds two turns to the bleedout timer.<br/>"

[IronSkin X2AbilityTemplate]
LocFriendlyName="Iron Skin"
LocFlyOverText="Iron Skin"
LocLongDescription="Incoming melee damage is reduced by 3."
LocHelpText="Incoming melee damage is reduced by 3."
LocPromotionPopupText="<Bullet/> Incoming melee damage is reduced by 3.<br/>"

[SmartMacrophages X2AbilityTemplate]
LocFriendlyName="Smart Macrophages"
LocFlyOverText="Smart Macrophages"
LocLongDescription="Heals injuries after a battle, lowering wound recovery time, and confers immunity to poison and acid."
LocHelpText="Lowers wound recovery time and confers immunity to poison and acid."
LocPromotionPopupText="<Bullet/> The number of hit points you lost during a battle, which is used to calculate time out wounded, is reduced by one.<br/><Bullet/> You are immune to poison and acid.<br/>"

[MindMerge X2AbilityTemplate]
LocFriendlyName="Mind Merge"
LocFlyOverText="Mind Merge"
LocLongDescription="Grants bonus will, critical chance and ablative hit points to an ally until the beginning of the player's next turn."
LocHelptext="Temporarily grants bonus will, critical chance and ablative hit points to an ally."
LocPromotionPopupText="<Bullet/> Grants the targeted ally 1 ablative (shield) hit point, plus another one per 30 psi offense score of the Psi Operative using Mind Merge.<br/><Bullet/> Grants the targeted ally 1 will per 10 psi offense score of the Psi Operative.<br/><Bullet/> Also grants the ally +1 critical chance per 10 psi offense score of the Psi Operative.<br/><Bullet/> Effect lasts until the Psi Operative's next turn.<br/><Bullet/> Three-turn cooldown.<br/><Bullet/> Only visible allies may be targeted.<br/><Bullet/> Improved Psi Amps grant additional bonuses to these effects.<br/><Bullet/> Requires one action."

[SoulMerge X2AbilityTemplate]
LocFriendlyName="Soul Merge"
LocFlyOverText="Soul Merge"
LocLongDescription="Increases effectiveness of Mind Merge by conferring larger bonuses to critical chance, will and ablative hit points, and reducing its cooldown period."
LocHelpText="Increases effectiveness of Mind Merge."
LocPromotionPopupText="<Bullet/> Reduces Mind Merge cooldown by 1 turn.<br/><Bullet/> Bonus ablative Hit Points improves to 1 per 20 psi offense score.<br/><Bullet/> Bonus will improves to 1 per 5 psi offense score.<br/><Bullet/> Grants a crit bonus of 1% per 5 psi offense."

[Shadowstrike_LW X2AbilityTemplate]
LocFriendlyName="Shadowstrike"
LocLongDescription="While concealed, gain +<Ability:SHADOWSTRIKEAIM/> bonus aim and +<Ability:SHADOWSTRIKECRIT/> bonus critical hit chance when attacking enemies."
LocHelpText="While concealed, gain bonus aim and bonus criticial hit chance when attacking enemies."
LocPromotionPopupText="<Bullet/> Shadowstrike bonuses will apply if the soldier re-enters concealment in a mission.<br/>"

[Formidable X2AbilityTemplate]
LocFriendlyName="Formidable"
LocFlyOverText="Formidable"
LocLongDescription="Your gear includes an extra layer of protection, granting 2 bonus ablative hit points and <Ability:BlastPadding/>% less damage from explosive attacks."
LocHelpText="Gain bonus hit points and reduce explosive damage taken."
LocPromotionPopupText="<Bullet/> Formidable reduces explosive damage taken by <Ability:BlastPadding/>%.

; Updated perk loc

[XComGame.PistolStandardShot X2AbilityTemplate]
[PistolStandardShot X2AbilityTemplate]
LocFriendlyName="Fire Pistol"
LocLongDescription="You have been trained to effectively utilize the full flexibility of a pistol as a complement to your primary weapon."
LocHelpText="Fire your pistol at a target."
LocFlyOverText=""

[XComGame.Killzone X2AbilityTemplate]
[KillZone X2AbilityTemplate]
LocFriendlyName="Kill Zone"
LocLongDescription="Take a reaction shot against any enemy that moves or attacks within a cone of fire."
LocHelpText="Enhanced overwatch in a cone of fire."
LocFlyOverText="Kill Zone"
LocPromotionPopupText="<Bullet/> There is no limit to the amount of Kill Zone shots a soldier can take outside of ammo counts.<br/><Bullet/> Kill Zone utilizes Squadsight, even if the soldier does not have the Long Watch ability.<br/><Bullet/> Kill Zone has a <Ability:SelfCooldown/> turn cooldown.<br/>"
LocFriendlyNameWhenConcealed="Kill Zone (Concealed)"

[XComGame.DeathFromAbove X2AbilityTemplate]
[DeathFromAbove X2AbilityTemplate]
LocFriendlyName="Death From Above"
LocLongDescription="Killing an enemy at a lower elevation with your <Ability:WeaponName/> costs only a single action, and does not end your turn. Also grants a long-range accuracy bonus for sniper rifles."
LocHelpText="Killing an enemy at a lower elevation with your <Ability:WeaponName/> costs only a single action, and does not end your turn."
LocFlyOverText="Death From Above"
LocPromotionPopupText="<Bullet/> Death From Above can combo well with pistol abilities or can simply make a soldier more mobile.<br/><Bullet/> Also grants a long-range accuracy bonus for sniper rifles at any elevation."

[XComGame.Implacable X2AbilityTemplate]
[Implacable X2AbilityTemplate]
LocFriendlyName="Implacable"
LocLongDescription="If you score one or more kills on your turn, you are granted a single bonus move."
LocHelpText="Gain up to one move per turn after making a kill."
LocFlyOverText="Implacable"
LocPromotionPopupText="<Bullet/> The Fleche ability cannot be used after gaining a bonus move from Implacable.<br/>"

[XComGame.VolatileMix X2AbilityTemplate]
[VolatileMix X2AbilityTemplate]
LocFriendlyName="Volatile Mix"
LocLongDescription="Your grenades' area of effect is increased by one tile."
LocHelpText="Your grenades cover a greater area of effect."
LocFlyOverText="Volatile Mix"
LocPromotionPopupText="<Bullet/> Your grenades do regular and environmental damage in the expanded area of effect, and apply any additional effects there as well.

[XComGame.Salvo X2AbilityTemplate]
[Salvo X2AbilityTemplate]
LocFriendlyName="Salvo"
LocLongDescription="Launching or throwing grenades, using heavy weapons or using the Gauntlet's Rocket Launcher with your first action will not end your turn."
LocHelpText="Grenades can be launched or thrown and heavy weapons and the Gauntlet's Rocket Launcher can be fired without ending the turn."
LocFlyOverText="Salvo"
LocPromotionPopupText="<Bullet/> Soldiers with the Salvo ability are prime candidates for heavy armor.<br/>"

[XComGame.Quickdraw X2AbilityTemplate]
[Quickdraw X2AbilityTemplate]
LocFriendlyName="Quickdraw"
LocLongDescription="Firing your pistol with your first action no longer ends your turn."
LocHelpText="Firing your pistol with your first action no longer ends your turn."
LocFlyOverText="Quickdraw"
LocPromotionPopupText="<Bullet/> Quickdraw allows the soldier to spread their fire around to different targets in the same turn.<br/>"

[XComGame.SharpshooterAim X2AbilityTemplate]
[SharpshooterAim X2AbilityTemplate]
LocFriendlyName="Aim"
LocLongDescription="Hunker Down now confers +<Ability:SHARPSHOOTERAIMBONUS/> Aim to the first shot on the following turn."
LocHelpText="Hunker Down now confers +<Ability:SHARPSHOOTERAIMBONUS/> Aim to the first shot on the following turn."
LocFlyOverText="HunkerDown - Aim"
LocPromotionPopupText="<Bullet/> The bonus granted by Aim can apply to either a pistol or primary weapon shot.<br/>"

[XComGame.LightningHands X2AbilityTemplate]
[LightningHands X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Fire your pistol at a target. This attack does not cost an action."
LocHelpText="Fire your pistol at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"
LocPromotionPopupText="<Bullet/> Lightning Hands can combo well with two-action abilities, as it does not prevent their use in the same turn.<br/><Bullet/> Lightning Hands has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[XComGame.IntrusionProtocol X2AbilityTemplate]
[IntrusionProtocol X2AbilityTemplate]
LocFriendlyName="Hack"
LocLongDescription="Attempt to remotely breach security on a network access point with your GREMLIN."
LocHelpText="You can remotely hack targets with your GREMLIN."
LocFlyOverText="Hack"
LocPromotionPopupText="<Bullet/> Map items (chests, workstations, etc.) can be hacked from a distance using the GREMLIN.<br/>"

[XComGame.EverVigilant X2AbilityTemplate]
[EverVigilant X2AbilityTemplate]
LocFriendlyName="Ever Vigilant"
LocLongDescription="If you spend all of your actions on moves, you are granted an automatic overwatch shot at the end of the turn."
LocHelpText="Automatically activate Overwatch if you did nothing but move this turn."
LocFlyOverText="Overwatch: Ever Vigilant"
LocPromotionPopupText="<Bullet/> Ever Vigilant enables an extremely mobile style of play for the soldier.<br/><Bullet/> Any action other than moving will invalidate Ever Vigilant.<br/>"

[XComGame.Phantom X2AbilityTemplate]
[Phantom X2AbilityTemplate]
LocFriendlyName="Phantom"
LocLongDescription="When the squad is revealed, this soldier remains concealed."
LocHelpText="When the squad is revealed, this soldier remains concealed."
LocFlyOverText="Phantom"
LocPromotionPopupText="<Bullet/> Even if the squad does not start a mission concealed, soldiers with Phantom will still begin the mission with concealment.<br/><Bullet/> If the soldier with Phantom is the one who breaks squad concealment, then Phantom does not apply.<br/>"

[XComGame.Shadowstep X2AbilityTemplate]
[Shadowstep X2AbilityTemplate]
LocFriendlyName="Shadowstep"
LocLongDescription="This soldier does not trigger overwatch or reaction fire."
LocHelpText="This soldier does not trigger overwatch or reaction fire."
LocPromotionPopupText="<Bullet/> A soldier with Shadowstep will not trigger Overwatch shots or Suppression fire, but they will be unable to draw Overwatch fire away from their teammates.<br/>"

[XComGame.Bladestorm X2AbilityTemplate]
[Bladestorm X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the soldier.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[XComeGame.BladestormAttack X2AbilityTemplate]
[BladestormAttack X2AbilityTemplate]
LocFriendlyName="Bladestorm"
LocLongDescription="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocHelpText="Free <Ability:SecondaryWeaponName/> attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Bladestorm"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Bladestorm will trigger if that enemy tries to attack the soldier.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Bladestorm will trigger when that enemy moves into melee range.<br/>"

[XComGame.Untouchable X2AbilityTemplate]
[Untouchable X2AbilityTemplate]
LocFriendlyName="Untouchable"
LocLongDescription="If you score a kill during your turn, the next attack against you during the enemy turn will miss."
LocHelpText="If you score a kill during your turn, the next attack against you during the enemy turn will miss."
LocFlyOverText="Untouchable"
LocPromotionPopupText="<Bullet/> When Untouchable is triggered the soldier is immune to the next damage dealing attack during the enemy turn, even Area of Effect attacks.<br/>"

[XComGame.RevivalProtocol X2AbilityTemplate]
[RevivalProtocol X2AbilityTemplate]
LocPromotionPopupText="<Bullet/> Revival Protocol can be used to revive unconscious soldiers, including those who have been stabilized after bleeding out.<br/><Bullet/> Revival Protocol, if used with your first action, will not end your turn.<br/><Bullet/> Starts with two charges, but upgrading your GREMLIN may provide more.<br/>"

[XComGame.ThreatAssessment X2AbilityTemplate]
[ThreatAssessment X2AbilityTemplate]
LocLongDescription="Aid Protocol grants the target a Covering Fire Overwatch shot."
LocPromotionPopupText="<Bullet/> Aid Protocol grants the target a Covering Fire Overwatch shot."

;;;;;;;;;;;;;;;;;;;;  SHINOBI ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[CoupDeGrace X2AbilityTemplate]
LocFriendlyName="Coup de Grâce"
LocFlyOverText="Coup de Grâce"
LocLongDescription="Coup de Grâce can instantly kill a disoriented, stunned or unconscious enemy."
LocHelpText="Chance to instantly kill a disoriented, stunned or unconscious enemy."
LocPromotionPopupText="<Bullet/> Coup de Grâce can only target non-robotic, disoriented, stunned or unconscious enemies.<br/><Bullet/> Coup de Grâce grants a base 25% chance to kill disoriented units and a base 50% chance to kill stunned/unconscious units.<br/><Bullet/> Coup de Grâce grants up to 75% additional chance to kill based on remaining target health.<br/>"

[CoupDeGrace2 X2AbilityTemplate]
LocFriendlyName="Coup de Grâce"
LocFlyOverText="Coup de Grâce"
LocLongDescription="Bonus to hit, damage, and critical chance with a melee weapon against a disoriented, stunned or panicking enemy."
LocHelpText="Bonus to hit, damage, and critical chance with a melee weapon against a disoriented, stunned, or panicking  enemy."
LocPromotionPopupText="<Bullet/> Coup de Grâce grants +50 aim, +50 critical chance and +2 damage against stunned and panicking enemies.<br/><Bullet/> The bonuses are reduced against disoriented enemies."

;;;;;;;;;;;;;;;;;;;;  SPECIALIST ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[Failsafe X2AbilityTemplate]
LocFriendlyName="Failsafe"
LocLongDescription="If you fail a hack, you prevent any negative effects from occurring."
LocHelpText="If you fail a hack, you prevent any negative effects from occurring."
LocFlyOverText="Failsafe"
LocPromotionPopupText="<Bullet/> If you fail a hack, you prevent any negative effects from occurring."

[FullOverride X2AbilityTemplate]
LocFriendlyName="Full Override"
LocLongDescription="Take permanent control of a robotic unit and potentially acquire ADVENT MECs for the Resistance."
LocHelpText="Take permanent control of a robotic unit and potentially acquire ADVENT MECs for the Resistance."
LocFlyOverText="Full Override"
LocPromotionPopupText="<Bullet/> Full Override is a special hack action usable against enemy robotic units.<br/><Bullet/> It has one charge that is only expended if a successful override occurs.<br/><Bullet/> Requires one action and ends the soldier's turn.<br/><Bullet/> The first hack option, Command Enemy, will grant control of the robotic unit for the duration of the mission.<br/><Bullet/> The second hack option, Master Enemy, also grants a stat bonus for the rest of the mission for all robots, and will permanently transfer any MEC units to the Resistance.<br/><Bullet/> If the Master Enemy hack succeeds, and the MEC and the specialist both survive the mission, the MEC will follow new programming and make its way to a Resistance base, where it will serve the Resistance. It does not need to be evacuated when the mission ends."

[BuffEnemy_FullOverride X2HackRewardTemplate]
FriendlyName="Overdrive"
Description="A failed hack will increase this target's Aim and Defense stats."

[ControlRobot_Mission X2HackRewardTemplate]
FriendlyName="Command Enemy"
Description="Take control of this unit for rest of the mission."

[ControlRobot_Permanent X2HackRewardTemplate]
FriendlyName="Master Enemy"
Description="Take control of this unit for rest of the mission and gain stat bonuses. MEC units will be reprogrammed to serve the Resistance."

[ScanningProtocol X2AbilityTemplate]
LocPromotionPopupText="<Bullet/> Scanning Protocol gains bonus charges with improved Gremlins.<br/><Bullet/> In addition to hidden and disguised enemies, enemies blocked from line of sight by walls or obstructions will also be revealed by Scanning Protocol.<br/>"


;;;;;;;;;;;;;;;;;;;;  GRENADIER ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[Protector X2AbilityTemplate]
LocFriendlyName="Protector"
LocLongDescription="Non-damaging grenades in your grenade-only slot gain a bonus use."
LocHelpText="Non-damaging grenades in your grenade-only slot gain a bonus use."
LocFlyOverText="Protector"
LocPromotionPopupText="<Bullet/> All non-damaging grenades except Ghost Grenades are viable for Protector.<br/>"

[HeavyOrdnance_LW X2AbilityTemplate]
LocFriendlyName="Heavy Ordnance"
LocLongDescription="Any damaging grenade in your grenade-only slot gains a bonus use."
LocHelpText="Any damaging grenade in your grenade-only slot gains a bonus use."
LocFlyOverText="Heavy Ordnance"
LocPromotionPopupText="<Bullet/> All damaging grenades are viable for Heavy Ordnance.<br/>"

[Sapper X2AbilityTemplate]
LocFriendlyName="Sapper"
LocLongDescription="Your explosives can destroy many cover objects."
LocHelpText="Your explosives can destroy many cover objects."
LocFlyOverText="Sapper"
LocPromotionPopupText="<Bullet/> Sapper allows frag grenades and other explosives to destroy many cover objects."

[CombatEngineer X2AbilityTemplate]
LocFriendlyName="Combat Engineer"
LocLongDescription="Your explosives do significantly greater damage to cover objects and other things on the battlefield."
LocHelpText="Your explosives do significantly greater damage to the environment."
LocFlyOverText="Combat Engineer"
LocPromotionPopupText="<Bullet/> More powerful than Sapper by itself, Combat Engineer stacks with Sapper to maximize environmental damage, although either perk alone will still destroy many cover objects.<br/><Bullet/> Combat Engineer also prevents environmental damage from falling off from the center of an explosion, meaning you will destroy objects in a larger area."

[NeedleGrenades X2AbilityTemplate]
LocFriendlyName="Needle Grenades"
LocLongDescription="Your explosives do not destroy loot when they kill enemies."
LocHelpText="Your explosives do not destroy loot when they kill enemies."
LocFlyOverText="Needle Grenades"
LocPromotionPopupText="<Bullet/> You have received extra training that enables you to employ explosive grenades that deploy specialized slivers that leave enemy loot intact."

[HEATWarheads X2AbilityTemplate]
LocFriendlyName="HEAT Warheads"
LocLongDescription="Your grenades now pierce up to 2 points of armor and shred one additional point of armor."
LocHelpText="Your grenades now pierce up to 2 points of armor and shred one additional point of armor."
LocFlyOverText="HEAT Warheads"
LocPromotionPopupText="<Bullet/> Your grenades now pierce (ignore) up to 2 points of armor and shred one additional point of armor.<br/>"

[Bombard_LW X2AbilityTemplate]
LocFriendlyName="Bombardier"
LocLongDescription="You may throw or launch grenades two additional tiles."
LocHelpText="You may throw or launch grenades two additional tiles."
LocFlyOverText="Bombardier"
LocPromotionPopupText="<Bullet/> Your grenades have 2 tiles extra range.<br/><Bullet/> This includes either launched or thrown grenades.<br/>"

[BluescreenBombs X2AbilityTemplate]
LocFriendlyName="Bluescreen Bombs"
LocLongDescription="Your flashbang grenades now disorient robotic units and reduce their resistance to hacking."
LocHelpText="Your flashbang grenades now disorient robotic units and reduce their resistance to hacking."
LocFlyOverText="Bluescreen Bombs"
LocPromotionPopupText="<Bullet/> Your flashbang grenades now disorient robotic units.<br/><Bullet/> Your flashbang grenades also reduce robotic hack defense.<br/>"

[TandemWarheads X2AbilityTemplate]
LocFriendlyName="Tandem Warheads"
LocLongDescription="Your grenades and rockets do full damage to units to the maximum extent of their area of effect."
LocHelpText="Your grenades and rockets do full damage to the maximum extent of their area of effect."
LocFlyOverText="Tandem Warheads"
LocPromotionPopupText="<Bullet/> Your grenades and rockets do full damage to units to the maximum extent of their area of effect.<br/><Bullet/> This doesn't apply to environmental damage."

[GhostGrenade X2AbilityTemplate]
LocFriendlyName="Ghost Grenade"
LocLongDescription="A specialized smoke grenade that causes the targeted ally to enter concealment."
LocHelpText="Put a single XCOM ally into concealment."
LocPromotionPopupText="<Bullet/> This ability only affects a single targeted ally; others in the smoke cloud are not concealed but do receive the defense bonus.<br/><Bullet/> Uses one action and ends your turn.<br/><Bullet/> One use per mission; abilities that add grenade charges do not provide any bonuses.<br/><Bullet/> Only works on XCOM soldiers, as civilians do not have training in concealment techniques.<br/><Bullet/> Small smoke cloud grants 20 defense; dense smoke bonuses do not apply.<br/><Bullet/> It does not fit in the standard XCOM grenade launcher and must be thrown at a visible ally.<br/><Bullet/> The Grenadier cannot use this ability when concealed."

[VanishingAct X2AbilityTemplate]
LocFriendlyName="Ghost Grenade"
LocHelpText="Specialized smoke grenade that puts an ally in concealment inside a small cloud of smoke."
LocFlyOverText="Ghost Grenade"

[BiggestBooms_LW X2AbilityTemplate]
LocFriendlyName="Biggest Booms"
LocLongDescription="Your grenades and standard rockets can inflict critical damage (<Ability:BIGGESTBOOMSCHANCE/>% chance for +<Ability:BIGGESTBOOMSDAMAGE/> damage)."
LocHelpText="Your grenades, standard rockets and micromissiles can inflict critical damage."
LocFlyOverText="Biggest Booms"
LocPromotionPopupText="<Bullet/> Grenades, standard rockets, and MEC micromissiles can inflict critical damage (<Ability:BIGGESTBOOMSCHANCE/>% chance for +<Ability:BIGGESTBOOMSDAMAGE/> damage).<br/><Bullet/> Does not apply to non-damaging grenades or the concussion rocket or Bunker Buster abilities.<br/><Bullet/> Grenade crits will grant +1 damage to ongoing damaging effects such as fire."

;;;;;;;;;;;;;;;;;;;;  GUNNER ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[Combatives X2AbilityTemplate]
LocFriendlyName="Combatives"
LocLongDescription="You may parry melee attacks and counterattack with your melee weapon. Also gain +<ABILITY:COMBATIVES_DODGE_LW/> dodge."
LocHelpText="You may parry melee attacks and counterattack with your melee weapon."
LocFlyOverText="Combatives"
LocPromotionPopupText="<Bullet/> You are very likely to parry the first melee attack against you in a turn and counterattack with your melee weapon.<br/><Bullet/> Soldier also gains <ABILITY:COMBATIVES_DODGE_LW/> dodge."

[Flush X2AbilityTemplate]
LocFriendlyName="Flush"
LocLongDescription="Special shot with a bonus to hit that does little or no damage but confers defense and dodge penalties and forces target to change position if it hits."
LocHelpText="Special shot that does little or no damage but confers defense and dodge penalties and forces target to change position."
LocFlyOverText="Flush"
LocPromotionPopupText="<Bullet/> Consumes <Ability:SelfAmmoCost/> ammo.<br/><Bullet/> Two-turn cooldown.<br/><Bullet/> +30 bonus to aim.<br/><Bullet/> Cannot crit or apply bonus ammo effects.<br/><Bullet/> Cannot be used from concealment.<br/><Bullet/> Target loses 10 defense and 10 dodge until the start of XCOM's next turn."
str_FlushEffect="Flushed"

;;;;;;;;;;;;;;;;;;;;  RANGER ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[Fortify X2AbilityTemplate]
LocFriendlyName="Fortify"
LocLongDescription="Activate to grant +<ABILITY:FORTIFY_DEFENSE_LW/> defense until the beginning of the next turn. Does not cost an action. Has a <ABILITY:FORTIFY_COOLDOWN_LW/>-turn cooldown."
LocHelpText="Activate to grant +<ABILITY:FORTIFY_DEFENSE_LW/> defense. Free action. <ABILITY:FORTIFY_COOLDOWN_LW/>-turn cooldown."
LocFlyOverText="Fortified"
LocPromotionPopUpText="<Bullet/> Activate to grant the soldier +<ABILITY:FORTIFY_DEFENSE_LW/> defense until the beginning of the soldier's next turn.<br/><Bullet/> Does not cost an action. Has a <ABILITY:FORTIFY_COOLDOWN_LW/>-turn cooldown."

[CombatFitness X2AbilityTemplate]
LocFriendlyName="Combat Fitness"
LocLongDescription="Gain <ABILITY:COMBAT_FITNESS_OFFENSE_LW/> aim, <ABILITY:COMBAT_FITNESS_MOBILITY_LW/> mobility, <ABILITY:COMBAT_FITNESS_HP_LW/> HP, <ABILITY:COMBAT_FITNESS_WILL_LW/> will, and <ABILITY:COMBAT_FITNESS_DODGE_LW/> dodge."
LocHelpText="This soldier has numerous stat bonuses."
LocPromotionPopUpText="<Bullet/> Combat Fitness provides <ABILITY:COMBAT_FITNESS_OFFENSE_LW/> aim, <ABILITY:COMBAT_FITNESS_MOBILITY_LW/> mobility, <ABILITY:COMBAT_FITNESS_HP_LW/> HP, <ABILITY:COMBAT_FITNESS_WILL_LW/> will, and <ABILITY:COMBAT_FITNESS_DODGE_LW/> dodge."

[Sprinter X2AbilityTemplate]
LocFriendlyName="Sprinter"
LocLongDescription="Gain 1 mobility."
LocHelpText="This soldier has bonus mobility."
LocPromotionPopUpText="<Bullet/> Sprinter provides 1 bonus mobility."

;;;;;;;;;;;;;;;;;;;;  SHARPSHOOTER ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[AlphaMikeFoxtrot X2AbilityTemplate]
LocFriendlyName="Alpha Mike Foxtrot"
LocFlyOverText="Alpha Mike Foxtrot"
LocLongDescription="You do <Ability:ALPHA_MIKE_FOXTROT_DAMAGE_LW/> additional points of base damage with your primary weapon."
LocHelpText="You do <Ability:ALPHA_MIKE_FOXTROT_DAMAGE_LW/> additional points of base damage with your primary weapon."
LocPromotionPopupText="<Bullet/> You do <Ability:ALPHA_MIKE_FOXTROT_DAMAGE_LW/> additional points of base damage with your primary weapon."

;;;;;;;;;;;;;;;;;;;;  ASSAULT ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;

[StreetSweeper2 X2AbilityTemplate]
LocFriendlyName="Street Sweeper"
LocFlyOverText="Street Sweeper"
LocLongDescription="Cone-based shotgun attack that does bonus damage to unarmored targets. Blocked by heavy cover."
LocHelpText="Cone-based shotgun attack that does bonus damage to unarmored targets. Blocked by heavy cover."
LocPromotionPopupText="<Bullet/> Medium-range, cone-based shotgun attack.<br/><Bullet/> The spread pattern is blocked by heavy cover.<br/><Bullet/> Uses one action and <Ability:SelfAmmoCost/> ammo, and has four-turn cooldown.<br/><Bullet/> Does 3 bonus damage against unarmored targets within the spread pattern.<br/><Bullet/> Cannot be used with non-shotgun weapons.<br/><Bullet/> Allies can be injured by this attack.<br/>"

[HuntersInstinct X2AbilityTemplate]
LocFriendlyName="Hunter's Instincts"
LocLongDescription="Ranged attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."
LocHelpText="Ranged attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."
LocFlyOverText="Hunter's Instincts"
LocPromotionPopupText="<Bullet/> Ranged attacks against flanked enemies deal +<Ability:HUNTERSINSTINCTDMG/> damage."

[HitWhereItHurts X2AbilityTemplate]
LocFriendlyName="Deadshot"
LocLongDescription="Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies."
LocHelpText="Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies."
LocFlyOverText="Deadshot"
LocPromotionPopupText="<Bullet/> Bonus <Ability:HITWHEREITHURTS/>% chance to critically hit enemies.<br/>"

[CoolUnderPressure X2AbilityTemplate]
LocFriendlyName="Cool Under Pressure"
LocLongDescription="You gain +<Ability:COOLUNDERPRESSUREBONUS/> Aim on Overwatch and other reaction shots, and they can critically hit."
LocHelpText="Bonus aim and chance to crit on Overwatch and reaction shots."
LocFlyOverText="Cool Under Pressure"
LocPromotionPopupText="<Bullet/> You gain +<Ability:COOLUNDERPRESSUREBONUS/> Aim on Overwatch and other reaction shots, and they can critically hit.<br/>

[BiggestBooms X2AbilityTemplate]
LocFriendlyName="Biggest Booms"
LocLongDescription="Your explosive attacks can inflict critical damage (<Ability:BIGGESTBOOMSCHANCE/>% chance for +<Ability:BIGGESTBOOMSDAMAGE/> damage)."
LocHelpText="Your explosives can inflict critical damage."
LocFlyOverText="Biggest Booms"
LocPromotionPopupText="<Bullet/> Your explosive attacks can inflict critical damage (<Ability:BIGGESTBOOMSCHANCE/>% chance for +<Ability:BIGGESTBOOMSDAMAGE/> damage).<br/>"

; New Class loc

[PsiOperative X2SoldierClassTemplate]
RankNames[8]="Master"
ShortNames[8]="Mstr."
RankIcons[8]= "UILibrary_LW_PerkPack.psirank_Master"

[LW_Sharpshooter X2SoldierClassTemplate]
DisplayName="Sharpshooter"
ClassSummary="Our sharpshooters engage enemy targets with pinpoint accuracy from extreme range. They may also be trained as designated marksmen, forgoing long-range capabilities for mobility."
LeftAbilityTreeTitle="Sniper"
RightAbilityTreeTitle="Marksman"

;ALPHABETICAL ORDER
RandomNickNames[0]="Apex"
RandomNickNames[1]="Ace"
RandomNickNames[2]="Aftermath"
RandomNickNames[3]="Alpha"
RandomNickNames[4]="Blackjack"
RandomNickNames[5]="Bullseye"
RandomNickNames[6]="Bolt"
RandomNickNames[7]="Big Shot"
RandomNickNames[8]="Big Sleep"
RandomNickNames[9]="Big Time"
RandomNickNames[10]="Boss"
RandomNickNames[11]="Bullseye"
RandomNickNames[12]="Checkmate"
RandomNickNames[13]="Chief"
RandomNickNames[14]="Colt"
RandomNickNames[15]="Dallas"
RandomNickNames[16]="Deadbolt"
RandomNickNames[17]="Deadeye"
RandomNickNames[18]="Deadlock"
RandomNickNames[19]="Deadwood"
RandomNickNames[20]="D.O.A."
RandomNickNames[21]="Eagle Eye"
RandomNickNames[22]="Eight Ball"
RandomNickNames[23]="Flatline"
RandomNickNames[24]="Game Time"
RandomNickNames[25]="Gangster"
RandomNickNames[26]="Grave Digger"
RandomNickNames[27]="Hat Trick"
RandomNickNames[28]="Hawkeye"
RandomNickNames[29]="Heater"
RandomNickNames[30]="High Noon"
RandomNickNames[31]="Hitman"
RandomNickNames[32]="Hollywood"
RandomNickNames[33]="Hype"
RandomNickNames[34]="Icon"
RandomNickNames[35]="Jackal"
RandomNickNames[36]="Judge"
RandomNickNames[37]="Lights Out"
RandomNickNames[38]="Lockdown"
RandomNickNames[39]="Long Shot"
RandomNickNames[40]="Longwalker"
RandomNickNames[41]="Needle"
RandomNickNames[42]="Pale Rider"
RandomNickNames[43]="Reaper"
RandomNickNames[44]="Scratch"
RandomNickNames[45]="Serial"
RandomNickNames[46]="Sheriff"
RandomNickNames[47]="Shooter"
RandomNickNames[48]="Showtime"
RandomNickNames[49]="Slick"
RandomNickNames[50]="Slinger"
RandomNickNames[51]="Stonecold"
RandomNickNames[52]="The Cleaner"
RandomNickNames[53]="The Kid"
RandomNickNames[54]="The Truth"
RandomNickNames[55]="Tombstone"
RandomNickNames[56]="Top Notch"
RandomNickNames[57]="Top Shelf"
RandomNickNames[58]="Two Tap"
RandomNickNames[59]="Undertaker"
RandomNickNames[60]="Valentine"
;ALPHABETICAL ORDER
RandomNicknames_Male[0]="Cowboy"
RandomNickNames_Male[1]="Godfather"
RandomNickNames_Male[2]="Mailman"
RandomNickNames_Male[3]="Sandman"
RandomNickNames_Male[4]="Slim"
RandomNickNames_Male[5]="Taxman"
RandomNickNames_Male[6]="Zeus"
RandomNickNames_Female[0]="Baroness"
RandomNickNames_Female[1]="Black Widow"
RandomNicknames_Female[2]="Calamity"
RandomNicknames_Female[3]="Queen Bee"
;ALPHABETICAL ORDER

[LW_Gunner X2SoldierClassTemplate]
DisplayName="Gunner"
ClassSummary="The Gunner is trained to use heavy automatic weapons, throwing a great mass of firepower at the enemy."
LeftAbilityTreeTitle="SAW Gunner"
RightAbilityTreeTitle="Machinegunner"

RandomNickNames[0]="Backfire"
RandomNickNames[1]="Baja"
RandomNickNames[2]="Bearcat"
RandomNickNames[3]="Brutal"
RandomNickNames[4]="Chainsaw"
RandomNickNames[5]="Flounder"
RandomNickNames[6]="Gameshow"
RandomNickNames[7]="Gonzo"
RandomNickNames[8]="Hawker"
RandomNickNames[9]="Kozmo"
RandomNickNames[10]="Lunchbox"
RandomNickNames[11]="Mangler"
RandomNickNames[12]="Meathook"
RandomNickNames[13]="Moose"
RandomNickNames[14]="Nanook"
RandomNickNames[15]="Nugget"
RandomNickNames[16]="Nuke"
RandomNickNames[17]="Ogre"
RandomNickNames[18]="Pancake"
RandomNickNames[19]="Panzer"
RandomNickNames[20]="Piston"
RandomNickNames[21]="Slinger"
RandomNickNames[22]="Sparrow"
RandomNickNames[23]="Spike"
RandomNickNames[24]="Yogi"
RandomNickNames[25]="Zarfer"
RandomNickNames_Male[0]="Chuckles"
RandomNickNames_Male[1]="Dingus"
RandomNickNames_Male[2]="Maniac"
RandomNickNames_Male[3]="Knuckles"
RandomNickNames_Male[4]="Walrus"
RandomNickNames_Female[0]="Bubbles"
RandomNickNames_Female[1]="Gadget"
RandomNickNames_Female[2]="Giggles"
RandomNickNames_Female[3]="Mango"
RandomNickNames_Female[4]="Pepper"

[LW_Ranger X2SoldierClassTemplate]
DisplayName="Ranger"
ClassSummary="The Ranger is the master of the rifle and may be trained to use it in offensive and defensive capacities."
LeftAbilityTreeTitle="Infantry"
RightAbilityTreeTitle="Defender"

RandomNickNames[0]="Bronco"
RandomNickNames[1]="Buck"
RandomNickNames[2]="Buckeye"
RandomNickNames[3]="Cobalt"
RandomNickNames[4]="Cowboy"
RandomNickNames[5]="Digger"
RandomNickNames[6]="Dinger"
RandomNickNames[7]="Frosty"
RandomNickNames[8]="Grunt"
RandomNickNames[9]="Hollywood"
RandomNickNames[10]="Hoss"
RandomNickNames[11]="Howler"
RandomNickNames[12]="Jaybird"
RandomNickNames[13]="Jayhawk"
RandomNickNames[14]="Judge"
RandomNickNames[15]="Marlin
RandomNickNames[16]="Mustang"
RandomNickNames[17]="Pappy"
RandomNickNames[18]="Painter"
RandomNickNames[19]="Pinto"
RandomNickNames[20]="Rascal"
RandomNickNames[21]="Rocky"
RandomNickNames[22]="Scooter"
RandomNickNames[23]="Skeeter"
RandomNickNames[24]="Skids"
RandomNickNames[25]="Stretch"
RandomNickNames[26]="Thumper"
RandomNickNames[27]="Werewolf"
RandomNickNames_Male[0]="Dusty"
RandomNickNames_Male[1]="Dutch"
RandomNickNames_Male[2]="Husker"
RandomNickNames_Male[3]="Slick"
RandomNickNames_Male[4]="Pops"
RandomNickNames_Female[0]="Aunty"
RandomNickNames_Female[1]="Goodnight"
RandomNickNames_Female[2]="Medusa"
RandomNickNames_Female[3]="Sugar"

[LW_Shinobi X2SoldierClassTemplate]
DisplayName="Shinobi"
ClassSummary="The Shinobi serves as our primary scouting unit, using a sword to deliver stealthy close-range attacks."
LeftAbilityTreeTitle="Saboteur"
RightAbilityTreeTitle="Kenshi"
;ALPHABETICAL ORDER
RandomNickNames[0]="Clutch"
RandomNickNames[1]="Cobra"
RandomNickNames[2]="Dagger"
RandomNickNames[3]="Dancer"
RandomNickNames[4]="Dasher"
RandomNickNames[5]="Dodger"
RandomNickNames[6]="Dragon"
RandomNickNames[7]="Fencer"
RandomNickNames[8]="Flipper"
RandomNickNames[9]="Furball"
RandomNickNames[10]="Gopher"
RandomNickNames[11]="Mace"
RandomNickNames[12]="Midnight"
RandomNickNames[13]="Neutron"
RandomNickNames[14]="Painter"
RandomNickNames[15]="Pasha"
RandomNickNames[16]="Poacher"
RandomNickNames[17]="Rattler"
RandomNickNames[18]="Razor"
RandomNickNames[19]="Ripper"
RandomNickNames[20]="Royal"
RandomNickNames[21]="Shady"
RandomNickNames[22]="Sticks"
RandomNickNames[23]="Spacebar"
RandomNickNames[24]="Splinter"
RandomNickNames[25]="Stalker"
RandomNickNames[26]="Talon"
RandomNickNames[27]="Undertaker"
RandomNickNames[28]="Wildcat"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Bender"
RandomNickNames_Male[1]="Cochise"
RandomNickNames_Male[2]="Slim"
RandomNickNames_Male[3]="Jockey"
RandomNickNames_Male[4]="Sandman"
RandomNickNames_Male[5]="Swordsman"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Panther"
RandomNickNames_Female[1]="Siren"
RandomNickNames_Female[2]="Sparkplug"
RandomNickNames_Female[3]="Spitfire"
;ALPHABETICAL ORDER

[LW_Specialist X2SoldierClassTemplate]
DisplayName="Specialist"
ClassSummary="Operating some of our most advanced equipment, Specialists deploy robotic drones on the battlefield that can be outfitted for combat or field medic duty."
LeftAbilityTreeTitle="Medic"
RightAbilityTreeTitle="Hacker"

;ALPHABETICAL ORDER
RandomNickNames[0]="Angel"
RandomNickNames[1]="Beta"
RandomNickNames[2]="Bishop"
RandomNickNames[3]="Bones"
RandomNickNames[4]="Breaker"
RandomNickNames[5]="Broker"
RandomNickNames[6]="Crypto"
RandomNickNames[7]="Cyber"
RandomNickNames[8]="Cypher"
RandomNickNames[9]="Data"
RandomNickNames[10]="Deacon"
RandomNickNames[11]="Dr. Feelgood"
RandomNickNames[12]="Doc"
RandomNickNames[13]="Feedback"
RandomNickNames[14]="Firewall"
RandomNickNames[15]="Genius"
RandomNickNames[16]="Gizmo"
RandomNickNames[17]="Glitch"
RandomNickNames[18]="Hijack"
RandomNickNames[19]="Jammer"
RandomNickNames[20]="Jester"
RandomNickNames[21]="Jolt"
RandomNickNames[22]="Lightning"
RandomNickNames[23]="Mayday"
RandomNickNames[24]="Mega"
RandomNickNames[25]="Newton"
RandomNickNames[26]="Overdrive"
RandomNickNames[27]="Patch"
RandomNickNames[28]="Professor"
RandomNickNames[29]="Ragtime"
RandomNickNames[30]="Rascal"
RandomNickNames[31]="Rattler"
RandomNickNames[32]="Red"
RandomNickNames[33]="Rift"
RandomNickNames[34]="Ripcord"
RandomNickNames[35]="Rogue"
RandomNickNames[36]="Scorch"
RandomNickNames[37]="Sentinel"
RandomNickNames[38]="Shady"
RandomNickNames[39]="Shakes"
RandomNickNames[40]="Shifter"
RandomNickNames[41]="Shrink"
RandomNickNames[42]="Slider"
RandomNickNames[43]="Solar"
RandomNickNames[44]="Sonar"
RandomNickNames[45]="Sparks"
RandomNickNames[46]="Stitch"
RandomNickNames[47]="Tapper"
RandomNickNames[48]="Teardrop"
RandomNickNames[49]="Tinker"
RandomNickNames[50]="Turbo"
RandomNickNames[51]="Venom"
RandomNickNames[52]="Vapor"
RandomNickNames[53]="Warbird"
RandomNickNames[54]="Warden"
RandomNickNames[55]="Whiskey"
RandomNickNames[56]="Wild Thing"
RandomNickNames[57]="Zulu"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Candyman"
RandomNickNames_Male[1]="Magic Man"
RandomNickNames_Male[2]="Priest"
RandomNickNames_Male[3]="Rainman"
RandomNickNames_Male[4]="Rooster"
RandomNickNames_Female[0]="Priestess"
RandomNickNames_Female[1]="Wolfmother"
RandomNickNames_Female[2]="Black Widow"
RandomNickNames_Female[4]="Duchess"
;ALPHABETICAL ORDER

[LW_Grenadier X2SoldierClassTemplate]
DisplayName="Grenadier"
ClassSummary="Serving as our demolitions experts, the Grenadiers provide heavy ordnance delivery whenever and wherever we need it. They may also specialize in support grenades to protect our troops and disable our enemies."
LeftAbilityTreeTitle="Boomer"
RightAbilityTreeTitle="Support"

;ALPHABETICAL ORDER
RandomNickNames[0]="All Day"
RandomNickNames[1]="All In"
RandomNickNames[2]="Animal"
RandomNickNames[3]="Baller"
RandomNickNames[4]="Big Country"
RandomNickNames[5]="Big Money"
RandomNickNames[6]="Big Nasty"
RandomNickNames[7]="Blaze"
RandomNickNames[8]="Boom Boom"
RandomNickNames[9]="Bomber"
RandomNickNames[10]="Buddy"
RandomNickNames[11]="Bulldog"
RandomNickNames[12]="Bull Rush"
RandomNickNames[13]="Claymore"
RandomNickNames[14]="Demo"
RandomNickNames[15]="Defcon"
RandomNickNames[16]="Devil Dog"
RandomNickNames[17]="Diesel"
RandomNickNames[18]="Encore"
RandomNickNames[19]="Fireball"
RandomNickNames[20]="Fridge"
RandomNickNames[21]="Gunner"
RandomNickNames[22]="Hammer"
RandomNickNames[23]="Hellfire"
RandomNickNames[24]="Hightower"
RandomNickNames[25]="Hoss"
RandomNickNames[26]="Volcano"
RandomNickNames[27]="Hurricane"
RandomNickNames[28]="Junkyard"
RandomNickNames[29]="Juggernaut"
RandomNickNames[30]="Knockout"
RandomNickNames[31]="Kong"
RandomNickNames[32]="Mad Dog"
RandomNickNames[33]="Meltdown"
RandomNickNames[34]="Moose"
RandomNickNames[35]="Nova"
RandomNickNames[36]="Nasty"
RandomNickNames[37]="Nitro"
RandomNickNames[38]="Overlord"
RandomNickNames[39]="Pitbull"
RandomNickNames[40]="Pyro"
RandomNickNames[41]="Redline"
RandomNickNames[42]="Rhino"
RandomNickNames[43]="Rocket"
RandomNickNames[44]="Seabreeze"
RandomNickNames[45]="Slab"
RandomNickNames[46]="Smash"
RandomNickNames[47]="Spitfire"
RandomNickNames[48]="Smokey"
RandomNickNames[49]="Swamp Thing"
RandomNickNames[50]="T-Bone"
RandomNickNames[51]="T-Rex"
RandomNickNames[52]="Tank"
RandomNickNames[53]="Thumper"
RandomNickNames[54]="Thunder"
RandomNickNames[55]="Tickle"
RandomNickNames[56]="Tiny"
RandomNickNames[57]="Titan"
RandomNickNames[58]="Dynamite"
RandomNickNames[59]="Torch"
RandomNickNames[60]="Wardog"
RandomNickNames[61]="Warhorse"
RandomNickNames[62]="Wildchild"
;ALPHABETICAL ORDER
RandomNicknames_Male[0]="Barbarian"
RandomNickNames_Male[1]="Big Boy"
RandomNicknames_Male[2]="Boss Man"
RandomNickNames_Male[3]="Cowboy"
RandomNickNames_Male[4]="Meathead"
RandomNickNames_Male[5]="Nero"
RandomNickNames_Male[6]="Papa Bear"
RandomNickNames_Male[7]="Wildman"
RandomNickNames_Female[0]="Amazon"
RandomNicknames_Female[1]="Boss Lady"
RandomNickNames_Female[2]="Cowgirl"
RandomNicknames_Female[3]="Domino"
RandomNickNames_Female[4]="Freya"
RandomNickNames_Female[5]="Mama Bear"
RandomNickNames_Female[6]="Deep Six"
RandomNickNames_Female[7]="Firebug"
;ALPHABETICAL ORDER

[LW_Assault X2SoldierClassTemplate]
DisplayName="Assault"
ClassSummary="The Assault serves as our primary close range unit, able to push in close and hold the line."
LeftAbilityTreeTitle="Raider"
RightAbilityTreeTitle="Breacher"
;ALPHABETICAL ORDER
RandomNickNames[0]="Bandit"
RandomNickNames[1]="Blitz"
RandomNickNames[2]="Brick"
RandomNickNames[3]="Butcher"
RandomNickNames[4]="Buzzsaw"
RandomNickNames[5]="Cajun"
RandomNickNames[6]="Chops"
RandomNickNames[7]="Cobra"
RandomNickNames[8]="Cougar"
RandomNickNames[9]="Coyote"
RandomNickNames[10]="Crash"
RandomNickNames[11]="Diamond"
RandomNickNames[12]="Enforcer"
RandomNickNames[13]="Fatal"
RandomNickNames[14]="Flash"
RandomNickNames[15]="Fury"
RandomNickNames[16]="Gator"
RandomNickNames[17]="Ghost"
RandomNickNames[18]="Gunner"
RandomNickNames[19]="Hound Dog"
RandomNickNames[20]="Ice"
RandomNickNames[21]="Icepick"
RandomNickNames[22]="Jaws"
RandomNickNames[23]="Judgment Day"
RandomNickNames[24]="Kinky"
RandomNickNames[25]="Monster"
RandomNickNames[26]="Mustang"
RandomNickNames[27]="Paladin"
RandomNickNames[28]="Pitbull"
RandomNickNames[29]="Pathfinder"
RandomNickNames[30]="Ringo"
RandomNickNames[31]="Samurai"
RandomNickNames[32]="Scorpion"
RandomNickNames[33]="Shogun"
RandomNickNames[34]="Shadow"
RandomNickNames[35]="Slayer"
RandomNickNames[36]="Snake"
RandomNickNames[37]="Snake Eyes"
RandomNickNames[38]="Solo"
RandomNickNames[39]="Specter"
RandomNickNames[40]="Spider"
RandomNickNames[41]="Stalker"
RandomNickNames[42]="Steel"
RandomNickNames[43]="Stinger"
RandomNickNames[44]="Templar"
RandomNickNames[45]="Trojan"
RandomNickNames[46]="Vandal"
RandomNickNames[47]="Viking"
RandomNickNames[48]="Warden"
RandomNickNames[49]="Warlord"
RandomNickNames[50]="Wolverine"
RandomNickNames[51]="Wildchild"
RandomNickNames[52]="Wildling"
RandomNickNames[53]="Zulu"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Axeman"
RandomNickNames_Male[1]="Duke"
RandomNickNames_Male[2]="Rocky"
RandomNickNames_Male[3]="Stallion"
RandomNickNames_Male[4]="Wolfman"
;ALPHABETICAL ORDER
RandomNickNames_Female[0]="Athena"
RandomNickNames_Female[1]="Duchess"
RandomNicknames_Female[2]="Iron Lady"
RandomNicknames_Female[3]="Iron Maiden"
RandomNicknames_Female[4]="Shieldmaiden"
RandomNickNames_Female[5]="Valkyrie"
;ALPHABETICAL ORDER

; New for 1.3

[InTheZone X2AbilityTemplate]
LocPromotionPopupText="<Bullet/> Serial is meant to chain enemy kills in a single action, as every kill is essentially free.<br/><Bullet/> Every successful kill does result in a reduction to critical hit chance and damage, however.<br/><Bullet/> Serial has a <Ability:SelfCooldown/> turn cooldown.<br/>"


[Fuse X2AbilityTemplate]
LocPromotionPopupText="<Bullet/> Fuse has a <Ability:SelfCooldown/>-turn cooldown.<br/>"

[BulletShred X2AbilityTemplate]
LocLongDescription="A Rupture shot grants a large bonus to critical hit chances and ensures that the target takes an additional +<Ability:RuptureAmount/> damage from all attacks in the future."
LocHelpText="A Rupture shot grants a large bonus to critical hit chances and ensures that the target takes increased damage from all attacks in the future."

[Faceoff X2AbilityTemplate]
LocPromotionPopupText="<Bullet/> Faceoff is best augmented by aggressive field position, granting a high chance to hit at multiple targets.<br/><Bullet/> Faceoff has a <Ability:SelfCooldown/> turn cooldown.<br/><Bullet/> Cannot be used from concealment."

[SoulSteal X2AbilityTemplate]
LocLongDescription="Soulfire transfers half of the damage done back to the Psi Operative as health or grants an ablative HP if you are uninjured."
LocHelpText="Soulfire heals a wounded operative or grants an ablative HP.
LocPromotionPopupText="<Bullet/> Soul Steal will replenish lost health for a wounded operative, or provide 1 ablative hit point for a healthy one.<br/><Bullet/> An operative may increase to no more than 8 ablative HP when using Soul Steal."

[CoveringFire X2AbilityTemplate]
LocLongDescription="Reaction shots confer an aim malus on enemies and can now be triggered by any enemy action, not just movement."
LocPromotionPopupText="<Bullet/> If triggered by an enemy action, Covering Fire will trigger before the enemy action completes.<br/><Bullet/> In addition, having the Covering Fire ability confers a temporary aim penalty upon any units you take a reaction shot at, regardless of whether it was a covering fire shot or not.<br/>"

[FlashbangGrenade X2GrenadeTemplate]
TacticalText="<Bullet/> Flashbang grenades don't do damage, but disorient and disrupt enemies in a large radius.<br><Bullet/> Friendly squad members will not be affected.<br/><Bullet/> Some powerful enemies may be able to resist their effects."
ThrownAbilityHelpText="Disorient hostile targets in the affected area."
LaunchedAbilityHelpText="Disorient hostile targets in the affected area."

[Whirlwind2 X2AbilityTemplate]
LocFriendlyName="Whirlwind"
LocLongDescription="If you hit with a melee attack during your turn, gain a bonus move."
LocHelpText="Gain one bonus move action after a successful melee attack."
LocFlyOverText="Whirlwind"
LocPromotionPopupText="<Bullet/> A soldier can only gain one move per turn with this ability.<br/><Bullet/> Cannot be employed if Reaper is active.<br/>"

[Solace_LW X2AbilityTemplate]
LocFriendlyName="Solace"
LocFlyOverText="Solace"
LocLongDescription="The Psi Operative may immediately extinguish mental impairments for a squadmate."
LocHelpText="The Psi Operative may immediately extinguish mental impairments for a squadmate."
LocPromotionPopupText="<Bullet/> Solace cleanses disorientation, mind control, panic and stun effects.<br/><Bullet/> Costs 1 action, <Ability:SelfCooldown/>-turn cooldown.<br/>

[QuickStudy X2AbilityTemplate]
LocFriendlyName="Quick Study"
LocLongDescription="Learn officer and AWC bonus abilities in half the time."
LocHelpText="Learn officer and AWC bonus abilities in half the time."
LocPromotionPopupText="<Bullet/> Learn officer and AWC bonus abilities in half the time."

[DoubleTap2 X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocFlyOverText="Double Tap"
LocLongDescription="Activate to fire a standard shot and gain a second action restricted to an additional shot or overwatching."
LocHelpText="Fire a standard shot and gain a bonus shot or overwatch action."
LocPromotionPopupText="<Bullet/> Activate to fire a standard shot and gain a second action restricted to Standard Shot, Precision Shot, Kubikiri or Overwatch.<br/><Bullet/> <Ability:SelfCooldown/>-turn cooldown.<br/>"

[DoubleTap2Bonus X2AbilityTemplate]
LocFriendlyName="Double Tap"
LocFlyOverText="Double Tap"

[RescueProtocol X2AbilityTemplate]
LocFriendlyName="Rescue Protocol"
LocFlyoverText="Rescue Protocol"
LocLongDescription="Use your Gremlin to grant a movement action to an ally."
LocHelpText="Grant a movement action to an ally."
LocPromotionPopupText="<Bullet/> Rescue Protocol can only be used on allies with no action points left.<br/><Bullet/> It cannot be used on concealed, suppressing or overwatching units.<br/><Bullet/>An ally cannot benefit from both Command and Rescue Protocol in the same turn.<br/><Bullet/> Uses one action.<br/><Bullet/> Charges increase with improved Gremlin technology.<br/>

